## Staging: lambdas
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 16 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                      NAME                      |
|----------|------------------------------------------------|
| update   | `aws_lambda_function.audit_logs`               |
|          | `aws_lambda_function.form_archiver`            |
|          | `aws_lambda_function.nagware`                  |
|          | `aws_lambda_function.reliability`              |
|          | `aws_lambda_function.reliability_dlq_consumer` |
|          | `aws_lambda_function.response_archiver`        |
|          | `aws_lambda_function.submission`               |
|          | `aws_lambda_function.vault_integrity`          |
|          | `aws_s3_object.audit_logs_code`                |
|          | `aws_s3_object.form_archiver_code`             |
|          | `aws_s3_object.nagware_code`                   |
|          | `aws_s3_object.reliability_code`               |
|          | `aws_s3_object.reliability_dlq_consumer_code`  |
|          | `aws_s3_object.response_archiver_code`         |
|          | `aws_s3_object.submission_code`                |
|          | `aws_s3_object.vault_integrity_code`           |
| recreate | `aws_signer_signing_job.vault_integrity[0]`    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.audit_logs will be updated in-place
  ~ resource "aws_lambda_function" "audit_logs" {
        id                             = "Audit_Logs"
      ~ last_modified                  = "2024-02-20T17:13:56.000+0000" -> (known after apply)
      ~ s3_object_version              = "u.KW21eNXOh1DTU9tGHd8P5pPz9dPzN2" -> (known after apply)
      ~ source_code_hash               = "9Ecr7guFtKFKmXR08DuKyXvCSuZBNcRDh2cM6IxGW50=" -> "bNAg94GAHXjQc4J2LUZXXCE/z8Te3HVUNwqSCPv+ZGE="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.form_archiver will be updated in-place
  ~ resource "aws_lambda_function" "form_archiver" {
        id                             = "Archive_Form_Templates"
      ~ last_modified                  = "2024-02-08T18:31:43.542+0000" -> (known after apply)
      ~ s3_object_version              = "79XIc6VR2aQuYzaduPsoOatLGFISakMg" -> (known after apply)
      ~ source_code_hash               = "Az0liG599yfRg7cqDAtpcwSYHtgtsQI2m7K2x/krsxY=" -> "QZJogAtXtf2reqQSXradkoiDtzkifYQYHbGCYRVF0ng="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.nagware will be updated in-place
  ~ resource "aws_lambda_function" "nagware" {
        id                             = "Nagware"
      ~ last_modified                  = "2024-02-08T19:33:25.528+0000" -> (known after apply)
      ~ s3_object_version              = "fuG43TeGDVNjxXr9SBeF7II5Kv7lVBoZ" -> (known after apply)
      ~ source_code_hash               = "2ZP5o8tCbep27P53xhm8tjX9DytomL5qhN8DZAlAVhQ=" -> "q014GQCcSIzKx9BA63EFuHvEq9chclEiA9/+5wNkiIQ="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability will be updated in-place
  ~ resource "aws_lambda_function" "reliability" {
        id                             = "Reliability"
      ~ last_modified                  = "2024-01-12T15:13:35.000+0000" -> (known after apply)
      ~ s3_object_version              = "2lirn5yEVP_uG9YM3ISy6i45Nc_DI.cg" -> (known after apply)
      ~ source_code_hash               = "Y9H8sLPZL9F6011TefCnrblzwHpvwKdIvkqDSPaxVK8=" -> "EZFEvwDftS3XPuSXSyTZDKU3eX0+BSEWsZGkOsZoKng="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability_dlq_consumer will be updated in-place
  ~ resource "aws_lambda_function" "reliability_dlq_consumer" {
        id                             = "Reliability_DLQ_Consumer"
      ~ last_modified                  = "2024-02-08T18:31:43.556+0000" -> (known after apply)
      ~ s3_object_version              = "BvpQY3NZQMaRMOsGpoZWavOy3AZupOJY" -> (known after apply)
      ~ source_code_hash               = "F7WbeUnrxxXYZkj7tkJyJcFV6inBl3QWsV9AzLcvfB4=" -> "bDtbLnTVAfL8zE5WoxhVihEVJ5OPBJRt//PAVFlHtiQ="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.response_archiver will be updated in-place
  ~ resource "aws_lambda_function" "response_archiver" {
        id                             = "Response_Archiver"
      ~ last_modified                  = "2024-02-08T18:31:43.601+0000" -> (known after apply)
      ~ s3_object_version              = "Hooe7gUS8n2KyXfCqL6CuX9xUeCBapo6" -> (known after apply)
      ~ source_code_hash               = "iCOPYEkuyPrXdcFRLr6qL6swUo/kXiUZTdHb0tWWuOE=" -> "V0RjdEcxstngkEKFxEPRLpwLdqhi24H0R2E9PQPm2sA="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.submission will be updated in-place
  ~ resource "aws_lambda_function" "submission" {
        id                             = "Submission"
      ~ last_modified                  = "2024-01-11T18:12:30.000+0000" -> (known after apply)
      ~ s3_object_version              = "W0HyLw2ExKKd03J3kzc74rvXTZwXg6tc" -> (known after apply)
      ~ source_code_hash               = "upOHVsX4QZQdq2GJDkBlWCCQTia0Q0WdEVP2ZbhUGXk=" -> "gtZkug1+4Rqn9lGtqlAnLqKzzt21hszryVDydBmdz4I="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.vault_integrity will be updated in-place
  ~ resource "aws_lambda_function" "vault_integrity" {
        id                             = "Vault_Data_Integrity_Check"
      ~ last_modified                  = "2024-02-20T20:16:47.000+0000" -> (known after apply)
      ~ s3_bucket                      = "forms-staging-lambda-code" -> (known after apply)
      ~ s3_key                         = "signed/29941171-a3bb-4511-be92-2c7d9ddd8912" -> (known after apply)
      ~ source_code_hash               = "PD5RmSEVjAYMZc1lvfSSn6O3RadR+J09hCPKVbQS/+g=" -> "mLd5pILg90ha73sCcCGaFO0BjssLvH8+HqVR7+3/mmA="
        tags                           = {}
        # (22 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_object.audit_logs_code will be updated in-place
  ~ resource "aws_s3_object" "audit_logs_code" {
        id                     = "audit_logs_code"
      ~ source_hash            = "9Ecr7guFtKFKmXR08DuKyXvCSuZBNcRDh2cM6IxGW50=" -> "bNAg94GAHXjQc4J2LUZXXCE/z8Te3HVUNwqSCPv+ZGE="
        tags                   = {}
      ~ version_id             = "u.KW21eNXOh1DTU9tGHd8P5pPz9dPzN2" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.form_archiver_code will be updated in-place
  ~ resource "aws_s3_object" "form_archiver_code" {
        id                     = "form_archiver_code"
      ~ source_hash            = "Az0liG599yfRg7cqDAtpcwSYHtgtsQI2m7K2x/krsxY=" -> "QZJogAtXtf2reqQSXradkoiDtzkifYQYHbGCYRVF0ng="
        tags                   = {}
      ~ version_id             = "79XIc6VR2aQuYzaduPsoOatLGFISakMg" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.nagware_code will be updated in-place
  ~ resource "aws_s3_object" "nagware_code" {
        id                     = "nagware_code"
      ~ source_hash            = "2ZP5o8tCbep27P53xhm8tjX9DytomL5qhN8DZAlAVhQ=" -> "q014GQCcSIzKx9BA63EFuHvEq9chclEiA9/+5wNkiIQ="
        tags                   = {}
      ~ version_id             = "fuG43TeGDVNjxXr9SBeF7II5Kv7lVBoZ" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.reliability_code will be updated in-place
  ~ resource "aws_s3_object" "reliability_code" {
        id                     = "reliability_code"
      ~ source_hash            = "Y9H8sLPZL9F6011TefCnrblzwHpvwKdIvkqDSPaxVK8=" -> "EZFEvwDftS3XPuSXSyTZDKU3eX0+BSEWsZGkOsZoKng="
        tags                   = {}
      ~ version_id             = "2lirn5yEVP_uG9YM3ISy6i45Nc_DI.cg" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.reliability_dlq_consumer_code will be updated in-place
  ~ resource "aws_s3_object" "reliability_dlq_consumer_code" {
        id                     = "reliability_dlq_consumer_code"
      ~ source_hash            = "F7WbeUnrxxXYZkj7tkJyJcFV6inBl3QWsV9AzLcvfB4=" -> "bDtbLnTVAfL8zE5WoxhVihEVJ5OPBJRt//PAVFlHtiQ="
        tags                   = {}
      ~ version_id             = "BvpQY3NZQMaRMOsGpoZWavOy3AZupOJY" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.response_archiver_code will be updated in-place
  ~ resource "aws_s3_object" "response_archiver_code" {
        id                     = "response_archiver_code"
      ~ source_hash            = "iCOPYEkuyPrXdcFRLr6qL6swUo/kXiUZTdHb0tWWuOE=" -> "V0RjdEcxstngkEKFxEPRLpwLdqhi24H0R2E9PQPm2sA="
        tags                   = {}
      ~ version_id             = "Hooe7gUS8n2KyXfCqL6CuX9xUeCBapo6" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.submission_code will be updated in-place
  ~ resource "aws_s3_object" "submission_code" {
        id                     = "submission_code"
      ~ source_hash            = "upOHVsX4QZQdq2GJDkBlWCCQTia0Q0WdEVP2ZbhUGXk=" -> "gtZkug1+4Rqn9lGtqlAnLqKzzt21hszryVDydBmdz4I="
        tags                   = {}
      ~ version_id             = "W0HyLw2ExKKd03J3kzc74rvXTZwXg6tc" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.vault_integrity_code will be updated in-place
  ~ resource "aws_s3_object" "vault_integrity_code" {
        id                     = "vault_integrity_code"
      ~ source_hash            = "TowbMcppnki+0a5fq50Oral3CqleiwGw7U1igvFz0Ws=" -> "mLd5pILg90ha73sCcCGaFO0BjssLvH8+HqVR7+3/mmA="
        tags                   = {}
      ~ version_id             = "T8_Y3lOs.tGjMhrm1ldzVlrAUqMcFexl" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_signer_signing_job.vault_integrity[0] must be replaced
-/+ resource "aws_signer_signing_job" "vault_integrity" {
      ~ completed_at               = "2024-01-11T18:12:31Z" -> (known after apply)
      ~ created_at                 = "2024-01-11T18:12:29Z" -> (known after apply)
      ~ id                         = "29941171-a3bb-4511-be92-2c7d9ddd8912" -> (known after apply)
      ~ job_id                     = "29941171-a3bb-4511-be92-2c7d9ddd8912" -> (known after apply)
      ~ job_invoker                = "687401027353" -> (known after apply)
      ~ job_owner                  = "687401027353" -> (known after apply)
      ~ platform_display_name      = "AWS Lambda" -> (known after apply)
      ~ platform_id                = "AWSLambda-SHA384-ECDSA" -> (known after apply)
      ~ profile_version            = "3cak3nO7rT" -> (known after apply)
      ~ requested_by               = "arn:aws:iam::687401027353:user/GitHub_Terraform" -> (known after apply)
      ~ revocation_record          = [] -> (known after apply)
      ~ signature_expires_at       = "2035-04-11T18:12:31Z" -> (known after apply)
      ~ signed_object              = [
          - {
              - s3 = [
                  - {
                      - bucket = "forms-staging-lambda-code"
                      - key    = "signed/29941171-a3bb-4511-be92-2c7d9ddd8912"
                    },
                ]
            },
        ] -> (known after apply)
      ~ status                     = "Succeeded" -> (known after apply)
      ~ status_reason              = "Signing Succeeded" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ source {
          ~ s3 {
              ~ version = "T8_Y3lOs.tGjMhrm1ldzVlrAUqMcFexl" # forces replacement -> (known after apply) # forces replacement
                # (2 unchanged attributes hidden)
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 16 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.audit_logs_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.form_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.nagware_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.reliability_dlq_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.response_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.response_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.vault_integrity"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_kms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_secrets"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_sqs"]
WARN -...
```

</details>
